# üóÑÔ∏è SQL Basics with SQLite (Day 15 ‚Äì Part 1)

**Goal:**  
Learn the foundations of SQL using SQLite inside Python:  
- Creating tables  
- Inserting records  
- Running basic SELECT queries

# 1. Import SQLite

In [7]:
import sqlite3
import pandas as pd

# Create in-memory database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# 2. Create Tables

In [8]:
cursor.execute("""
CREATE TABLE students (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    major TEXT
)
""")

cursor.execute("""
CREATE TABLE courses (
    course_id INTEGER PRIMARY KEY,
    course_name TEXT,
    credits INTEGER
)
""")

# 3. Insert Data

In [9]:
students_data = [
    (1, "Zeeshan", 21, "Computer Science"),
    (2, "Samiya", 22, "Information Tech"),
    (3, "Farhan", 20, "Mathematics"),
    (4, "Meera", 23, "Statistics")
]

courses_data = [
    (101, "Database Systems", 3),
    (102, "Machine Learning", 4),
    (103, "Probability & Stats", 3)
]

cursor.executemany("INSERT INTO students VALUES (?, ?, ?, ?)", students_data)
cursor.executemany("INSERT INTO courses VALUES (?, ?, ?)", courses_data)
conn.commit()

# 4. Run Basic SELECT Queries

In [12]:
df_students = pd.read_sql("SELECT * FROM students", conn)
df_students

   student_id     name  age             major
0           1  Zeeshan   21  Computer Science
1           2   Samiya   22  Information Tech
2           3   Farhan   20       Mathematics
3           4    Meera   23        Statistics

In [13]:
df_courses = pd.read_sql("SELECT * FROM courses", conn)
df_courses

   course_id          course_name  credits
0        101     Database Systems        3
1        102     Machine Learning        4
2        103  Probability & Stats        3

In [14]:
pd.read_sql("SELECT name, major FROM students", conn)

      name             major
0  Zeeshan  Computer Science
1   Samiya  Information Tech
2   Farhan       Mathematics
3    Meera        Statistics

# 5. WHERE Clause

In [15]:
pd.read_sql("SELECT * FROM students WHERE age > 21", conn)

   student_id    name  age             major
0           2  Samiya   22  Information Tech
1           4   Meera   23        Statistics

# ‚úÖ Summary (Day 15 ‚Äì Part 1):

- Created students and courses tables
- Inserted records into both tables
- Ran SELECT queries with column selection
- Used WHERE for filtering